const AboutPage = () => {
  return (
    <div className="w-[80%] mx-auto mt-10">
      <h2 className="text-3xl mb-4">درباره ما</h2>
      <p className="">
        تیم ما متشکل از ۹ دانشجوی خلاق دانشگاه
        خوارزمی است که دغدغه اصلی‌مون رشد و پیشرفت
        در حوزه‌های برنامه‌نویسی و توسعه نرم‌افزار
        هست،
        <br />
        در همین راستا و برای تحقق مسئولیت
        اجتماعیمون به دنبال ایجاد بستری پویا برای
        آموزش و انتقال تجارب از کارکشتگان هر حوزه
        شدیم. <br />
        در حال حاضر مشغول تقویت منابع و امکانات
        هستیم
      </p>
      <h2 className="text-3xl mt-8 mb-4">
        حکایت آموزشکار
      </h2>
      <p>
        بعد از تلاش های پیاپی برای پیدا کردن موضوع
        برای ایجاد یک استارتاپ خوب، اعضای آموزشیار
        به این نتیجه رسیدن که{' '}
        <span className="text-red-500">
          مهارت نداشتن
        </span>{' '}
        دلیل اصلی کار پیدا نکردن خیلی از افراد
        است. اینجوری شد که ماموریت آموزشیار آغاز
        شد.
      </p>
    </div>
  );
};

export default AboutPage;
