import ResumeSection from '../../../components/Resume/ResumeSection';

export default function ResumeTrainingPage() {
  const h2Class = 'mb-4 text-secondaryColor';
  const divClass =
    'p-4 mb-12 bg-primaryColor text-white rounded-md';

  const divClassNormal = 'mb-12';
  const h2ClassNormal = 'mb-4';

  const listClass = 'pr-8 list-disc list-outside';

  return (
    <div className="main">
      <h1 className="inline-block pb-2 mb-8 border-b-2">
        آموزش رزومه نویسی
      </h1>
      <ResumeSection
        title="اهمیت داشتن یک رزومه خوب:"
        text="یک رزومه عالی بهترین راه برای متمایز شدن از دیگران است. این به کارفرمای شما یک ایده واضح از اینکه شما چه کسی هستید و چه کاری می توانید انجام دهید می دهد. یک رزومه خوب دانش شما را در مورد شغلی که برای آن درخواست می کنید و مهارت ها و تجربه شما را نشان می دهد."
      />
      <ResumeSection
        title="روش های نوشتن یک رزومه کاری حرفه ای"
        text="برای نوشتن یک رزومه کاری خوب می توانید از سرویس های آنلاین نوشتن رزومه استفاده نمائید یا اینکه با فراگیری نکات مهم در نگارش رزومه های شغلی خود دست به کار شده و آن را پیاده سازی کنید، اما پیشنهاد ما استفاده از رزومه ساز آنلاین آموزشیار برای کسب بهترین نتیجه ممکن است چرا که این سرویس امکانات کاملی را در عین رایگان بودن خدمت شما ارائه می نماید تا بتوانید در مدت زمان کمتر از 10 دقیقه به یک رزومه استاندارد رسیده و شانس خود را برای موفقیت در مرحله اول استخدام بسیار بالا ببرید."
      />

      <div className={divClassNormal}>
        <h2 className={h2ClassNormal}>
          انواع رزومه
        </h2>
        <ul className={listClass}>
          <li>ترتیب زمانی</li>
          <li>عملکردی یا مهارتی</li>
          <li>ترکیبی</li>
          <li>هدفمند</li>
        </ul>
      </div>

      <div className={divClass}>
        <h2 className={h2Class}>رزومه زمانی</h2>
        <p>
          نگارش رزومه به ترتیب زمانی جزو روش هایی
          می باشد که اکثر کارفرماها آن را تایید می
          نمایند. نگارش این نوع رزومه اینگونه است،
          از آخر به اول طبق تاریخ سوابق و پیشینه
          درسی، مهارتی و شغلی خود را بیان می
          نمایید و این موضوع باعث می شود که رزومه
          کاری شما سرشار از جزئیات باشد.
        </p>
      </div>

      <div className={divClass}>
        <h2 className={h2Class}>رزومه مهارتی</h2>
        <p>
          برای شغل های مدیریتی رزومه مهارتی
          پیشنهاد می شود که نگارش آن بر مبنا مهارت
          های شغلی و توانمندی صورت می گیرد. در این
          رزومه چیزی که بسیار مهم است توانمندی در
          شغل مورد نظر می باشد و مدارک تحصیلی
          چندان اهمیتی ندارد.
        </p>
      </div>
      <div className={divClass}>
        <h2 className={h2Class}>رزومه ترکیبی</h2>
        <p>
          در رزومه ترکیبی نوع نگارش به صورت
          داستانی خواهد بود یعنی اینکه تجربه و
          مهارت های بدست آمده از هر شغلی را همراه
          با سوابق شغلی خود بیان داشته باشید.
        </p>
      </div>
      <div className={divClass}>
        <h2 className={h2Class}>رزومه هدفمند</h2>
        <p>
          نکته ای که باید در رزومه هدفمند رعایت
          شود اینکه برای شغل مورد نظر مدارک تحصیلی
          که ارتباطی با آن ندارد را نادیده بگیرید
          و سابقه شغلی خود را در ارتباط با شغل
          مورد نظر جدید بیان نمایید.
        </p>
      </div>

      <ResumeSection
        title="در رزومه کاری چه بنویسیم؟"
        text={
          <p>
            دانستن اینکه چه چیزهایی در رزومه باید
            نوشته شود و از هر اطلاعات بی ارزش به
            دور باشد بسیار اهمیت دارد. وقتی آگهی
            برای یک شغل از سوی یک شرکت منتشر می
            شود قطعا مواردی تحت عنوان مهارت و
            توانایی در آن آگهی بیان شده است و شما
            با مطالعه کامل آگهی از جزئیات آن مطلع
            شوید و در صورت برخوردار بودن آن مهارت
            ها می توانید در رزومه کاری به انها
            اشاره نمایید. یک رزومه خوب و موثر را
            برای شرکت مورد نظر طراحی داشته باشید
            یعنی اینکه کارفرما با مشاهده رزومه شما
            متوجه شود که چه قدم هایی می توانید
            برای شرکت آنها بردارید. بنابراین
            طولانی بودن رزومه کاری دلیلی بر قبولی
            رزومه شما نخواهد بود و باید رزومه ای
            موثر و خلاصه توسط شما تنظیم گردد.
            <br />
            در رزومه به توانمندی و مهارت های خود
            اشاره داشته باشید که این کار را به شکل
            های مختلف همچون نمودار و ... نمایش
            دهید. رعایت این موارد سبب می گردد که
            رزومه شما بصورت یک رزومه کاملا موثر و
            حرفه ای طراحی گردد و در رسیدن به شغل
            مورد نظر بسیار اهمیت دارد.
          </p>
        }
      />

      <ResumeSection
        title="نوشتن یک رزومه خوب و عالی"
        text="تا اینجای کار شما مرحله اول رزومه خود را طراحی نموده اید و برای اینکه آن را تبدیل به یک رزومه خوب و عالی نمایید می بایست به ویرایش های متعدد آن بپردازید تا از هیچ گونه خطا و اشتباهی برخوردار نباشد. طریقه نوشتن رزومه کاری بسیار مهم است و آنقدر باید حرفه ای باشد تا کارفرما با خواندن جملات داخل آن دیدی خوب نسبت به شما پیدا کند."
      />

      <ResumeSection
        title="اصول نوشتن رزومه کاری"
        text={
          <p>
            اصول نوشتن رزومه کاری در واقع مواردی
            هستند که شما می بایست با رعایت آنها به
            نوشتن یک رزومه کاری استاندارد نزدیک
            شوید. نوشتن رزومه کاری اصولی و
            استاندارد شرایطی دارد که تلاش نمودیم
            در این مقاله به تفسیر در مورد آن بحث
            کنیم، امیدواریم با مطالعه این مطلب
            کامل و مفید توانسته باشیم دانش تخصصی
            نوشتن یک رزومه موفق را برای شما به اوج
            رسانده تا انشالله با علم به شرایط و
            مشخصات یک رزومه خوب همانند یک متخصص
            کارکشته به نوشتن رزومه بپردازید. در
            زیر مورد وار مجددا به موارد مهم نوشتن
            رزومه کاری اشاره میکنیم که هر کدام جزو
            مهمترین موارد هستند اشاره می نمائیم.
            <ul className={`${listClass} mt-8`}>
              <li>کامل بودن اطلاعات</li>
              <li>به روز بودن اطلاعات و رزومه</li>
              <li>
                صداقت در بیان محتویات و مطالب
              </li>
              <li>انتخاب قالب مناسب با شغل</li>
              <li>
                خلاصه بودن ( یک تا نهایتا دو صفحه)
              </li>
              <li>
                پرهیز از دیزاین زیاد و شلوغ بودن
              </li>
              <li>
                نوشتن رزومه مطابق با شرایط آگهی
                شغل
              </li>
            </ul>
          </p>
        }
      />
      <ResumeSection
        title="نکات مهم در نوشتن رزومه کاری"
        text="در نوشتن رزومه کاری می بایست دقت کنید که ترتیب نوشتن موارد در رزومه را رعایت نمائید. اطلاعات می بایست صحت و دقت داشته باشند و از ذکر مواردی که نمی توانید با سند و مدرک آنها را اثبات کنید به جد بپرهیزید. بوسیله آمار و اعداد از گفته ها و ادعاهای خود در مورد تجربیات و توانائی های خود حمایت نمائید. برای مثال اگر می گویید توانسته اید فروش یک شرکت را به عنوان فروشنده یا بازاریاب رشد دهید دقیق ذکر کنید که این افزایش چند درصد بوده است."
      />

      <ResumeSection
        title="چگونه یک رزومه خوب بنویسیم؟"
        text={
          <p>
            اینکه چگونه یک رزومه کاری خوب بنویسیم
            بستگی به دانش ما در مورد رزومه نویسی
            دارد. شما به عنوان یک فرد که به دنبال
            استخدام است قطعا در حوزه ای خاص
            توانائی ها و تجربیاتی را با خود یدک می
            کشید. این توانائی ها شامل مباحث تئوری
            و عملی می شوند. مباحث تئوری در واقع
            همان تحصیلات آکادمیک بوده و مباحث عملی
            را می توان به عنوان تجربیات کاری گذشته
            شما لیست نمود. اگر قصد دارید که بدانید
            چطور یک رزومه خوب بنویسید باید بگوییم
            جواب این سوال در واقع این است که شما
            می بایست به درستی و با رعایت اصول
            مواردی مشخص را در رزومه خود قید
            نمائید.در واقع رعایت اصل زیر میتواند
            از رزومه شما یک رزومه رد نشدنی بسازد.
            <ul
              className={`${listClass} list-decimal my-4`}
            >
              <li>چیدمان درست اطلاعات</li>
              <li>نوشتن موارد مهم و ضروری</li>
              <li>وزن دادن به اطلاعات</li>
            </ul>
            در واقع ابتدا شما باید بدانید که چه
            چیز را در کجای رزومه باید بنویسید. دوم
            باید بدانید که لیست نمودن چه مواردی
            الزامی است و چه مواردی را نباید نوشت و
            سوم تقویت نوشته ها با اعداد و ارقام و
            ذکر شاهد برای ادعاهای شماست.
          </p>
        }
      />
    </div>
  );
}
