import React from 'react';
import enfj from '../../images/enfj.svg';
import './style.css';
import PersonTypes from './PersonTypes/PersonTypes';
import HeaderType from './Type/Type';
import barack from '../../images/barack.svg';
import oprah from '../../images/oprah.svg';
import ben from '../../images/oprah.svg';
import john from '../../images/john.svg';
import GreatTalk from './GreatTalk/GreatTalk';

function ENFJ() {
  return (
    <main>
      <HeaderType
        typeName={'قهرمان'}
        type={'ENFJ-A / ENFJ-T'}
        typeImg={enfj}
        color={'#33A474'}
      />

      <section className="container mx-auto  mt-10 p-20 font-medium ">
        <h1 className="text-3xl text-[#51596A] pb-5">
          شخصیت قهرمان
        </h1>
        <GreatTalk
          text="هر کاری که هم اکنون انجام می‌دهید همچون موج به بیرون گسترش می‌یابد و همه را تحت تأثیر قرار می‌دهد. وضعیت شما می‌توانید موجب درخشش قلبتان شود یا اضطراب را منتقل نماید. نفس شما می‌توانید عشق بتاباند یا اتاق را در افسردگی فرو ببرد. نگاهتان می‌تواند شادی را بیدار کند. کلماتتان می‌تواند الهام‌بخش آزادی باشد. تک‌تک اعمال شما می‌تواند قلب‌ها و ذهن‌ها را باز کند."
          author="DAVID DEIDA"
        />

        <div className="p-5 text-[#545C6D] ">
          <p className="text-md">
            قهرمانان رهبرانی بالفطره و سرشار از
            عشق و شور و جذبه هستند. این شخصیت‌ها
            که حدود دو درصد از جمعیت را تشکیل
            می‌دهند اغلب سیاستمداران، مربیان و
            معلمان ما هستند که الهام‌بخشیدن دیگران
            برای برای موفقیت و انجام کارهای خوب در
            جهان هستند. قهرمانان به‌طور طبیعی
            دارای اعتماد به نفس هستند که موجب پدید
            آمدن نفوذ می‌شود، از هدایت کردن دیگران
            برای همکاری با یکدیگر و بهبود بخشیدن
            خود و جامعه‌شان دچار غرور و شادی
            می‌شوند.
          </p>
        </div>

        <div className=" p-5 text-[#545C6D] mt-5">
          <h2 className="text-lg text-[#51596A] pb-5">
            اعتقاد راسخ به مردم
          </h2>
          <p className="text-xl">
            مردم جذب شخصیت‌های قوی می‌شوند، و
            قهرمانان اصالت، دغدغه و نوع‌دوستی از
            خود ساطع می‌کنند و از به پا خاستن و
            صحبت کردن در هنگامی که احساس می‌کنند
            چیزی باید گفت نمی‌ترسند. آنها به‌راحتی
            می‌توانند با دیگران ارتباط برقرار
            کنند، به‌خصوص به صورت حضوری و ماهیت
            روشنگرانه افراد دارای گونه شخصیتی
            قهرمان به آنها کمک می‌کند تا به ذهن
            همه دسترسی پیدا کنند، چه از طریق حقایق
            و منطق یا احساسات خام. قهرمانان
            به‌راحتی انگیزه‌های افراد و رویدادهای
            به ظاهر مجزا را مشاهده می‌کنند و قادر
            هستند این ایده‌ها را در کنار هم قرار
            دهند و ارتباط آنها را به‌عنوان هدفی
            مشترک با فصاحت و نوعی مسحورکنندگی بیان
            کنند.
          </p>
        </div>

        <div className=" p-5 text-[#545C6D]">
          <p className="text-md">
            افراد دارای گونه شخصیتی قهرمان
            نوع‌دوستانی پرشور هستند، گاهی اوقات
            حتی تا مرز نقض، و بعید است وقتی در
            تأیید مردم و ایده‌های آنها به پا
            می‌خیزند از سلاح به دست گرفتن هراس
            داشته باشند. جای تعجب نیست که بسیاری
            از قهرمانان معروف رهبران سیاسی و
            فرهنگی بانفوذی هستند - این گونه شخصیتی
            می‌خواهد راه آینده‌ای روشن‌تر را نشان
            دهد، چه با هدایت یک ملت به سمت رفاه،
            یا رهبری تیم لیگ سافت‌بال برای پیروز
            شدن در مبارزه‌ای دشوار.
          </p>
        </div>
        <div class="description-pullout">
          قهرمانان افرادی اصیل و اهل توجه هستند که
          وقت حرف زدن حرف می‌زنند و وقت عمل کردن
          عمل می‌کنند، و هیچ چیزی به اندازه
          پذیرفتن مسئولیت، متحد کردن و انگیزه‌بخشی
          به تیم خود با اشتیاقی سرایت‌کننده آنها
          را خوشحال نمی‌کند.
        </div>
        <div className=" p-5 text-[#545C6D]">
          <p className="text-md">
            افراد دارای گونه شخصیتی قهرمان
            نوع‌دوستانی پرشور هستند، گاهی اوقات
            حتی تا مرز نقض، و بعید است وقتی در
            تأیید مردم و ایده‌های آنها به پا
            می‌خیزند از سلاح به دست گرفتن هراس
            داشته باشند. جای تعجب نیست که بسیاری
            از قهرمانان معروف رهبران سیاسی و
            فرهنگی بانفوذی هستند - این گونه شخصیتی
            می‌خواهد راه آینده‌ای روشن‌تر را نشان
            دهد، چه با هدایت یک ملت به سمت رفاه،
            یا رهبری تیم لیگ سافت‌بال برای پیروز
            شدن در مبارزه‌ای دشوار.
          </p>
        </div>
      </section>
      <PersonTypes
        img1={barack}
        name1={' Barack Obama'}
        img2={oprah}
        name2={'  Oprah Winfrey '}
        img3={john}
        name3={' John Cusack'}
        img4={ben}
        name4={'Ben Affleck'}
      />
    </main>
  );
}

export default ENFJ;
