import React from 'react';
import entj from '../../images/entj.svg';
import entjSvg from '../../images/entjSvg.svg';
import './style.css';
import PersonTypes from './PersonTypes/PersonTypes';
import HeaderType from './Type/Type';
import Margaret from '../../images/margaret.svg';
import steve from '../../images/steve.svg';
import whoopi from '../../images/whoopi.svg';
import franklin from '../../images/franklin.svg';
import GreatTalk from './GreatTalk/GreatTalk';

function ENTJ() {
  return (
    <main>
      <HeaderType
        typeName={'فرمانده'}
        type={'ENTJ-A / ENTJ-T'}
        typeImg={entj}
        color={'#88619A'}
      />

      <section className="container mx-auto  mt-10 p-20 font-medium   ">
        <h1 className="text-3xl text-[#51596A] pb-5">
          شخصیت “فرمانده”
        </h1>

        <GreatTalk
          text="زمانتان محدود است، پس آن را با زندگی کردن بجای شخص دیگری هدر ندهید. به دام جزم‌اندیشی نیفتید - که به معنای زندگی کردن با نتایج حاصل از تفکر دیگران است. اجازه ندهید سر و صدای نظرات دیگران صدای درونی خودتان را غرق کند. و از همه مهمتر، شجاعت پیروی از قلب و شهود خود را داشته باشید. آن‌ها می‌دانند شما واقعاً می‌خواهید به چه کسی تبدیل شوید. تمام چیزهای دیگر در درجه دوم اهمیت است."
          author="STEVE JOBS"
        />

        <div className="p-5 text-[#545C6D] ">
          <p className="text-md">
            فرماندهان، رهبرانی بالفطره هستند.
            افراد دارای این گونه شخصیتی تجسم
            کاریزما و اعتماد به نفس هستند و قدرت
            را طوری به نمایش می‌گذارند که دیگران
            را برای هدفی مشترک گرد هم می‌آورند.
            اما فرماندهان برخلاف همتای حساس‌تر خود
            یعنی پیشگامان، سطح اغلب بی‌رحمانه‌ای
            از عقلانیت دارند و از انگیزه، اراده و
            ذهن تیز خود برای رسیدن به هر هدفی که
            برای خود تعیین کرده‌اند، استفاده
            می‌کنند. شاید خیلی خوب باشد که آنها
            تنها سه درصد از جمعیت را تشکیل می‌دهند
            تا مبادا به پایمال کردن سایر گونه‌های
            شخصیتی ترسوتر و حساس‌تر بپردازند که
            بقیه جمعیت جهان را تشکیل می‌دهند - اما
            باید به‌خاطر بسیاری از شرکت‌ها و
            مؤسساتی که هر روز با آنها مواجهیم باید
            قدردان فرماندهان باشیم.
          </p>
        </div>

        <div className=" p-5 text-[#545C6D] mt-5">
          <h2 className="text-lg text-[#51596A] pb-5">
            شادی در لذت موفقیت نهفته است
          </h2>
          <p className="text-md">
            اگر فرماندهان عاشق چیزی باشند، آن چیز
            چالشی خوب اعم از بزرگ یا کوچک است و
            عمیقاً معتقدند که اگر زمان و منابع
            کافی در اختیارشان باشد، می‌توانند به
            هر هدفی دست یابند. این کیفیت باعث
            می‌شود افراد دارای گونه شخصیتی فرمانده
            به کارآفرینانی درخشان تبدیل شوند و
            توانایی آنها برای تفکر استراتژیک و
            داشتن تمرکز طولانی‌مدت در حین اجرای هر
            مرحله از برنامه‌های خود با اراده و
            دقت، باعث می‌شود به رهبرانی قدرتمند در
            کسب و کار تبدیل گردند. این اراده اغلب
            نوعی رسالت درونی است، چرا که فرماندهان
            با اراده مطلق خود به سمت اهدافشان حرکت
            می‌کنند حال آنکه دیگران ممکن است تسلیم
            شوند و مهارت‌های اجتماعی آنها به این
            معنا است که به احتمال زیاد سایر افراد
            را با خود همراه می‌کنند و در این روند
            به نتایجی چشمگیر دست می‌یابند
          </p>
        </div>
        <figure className="m-10">
          <img src={entjSvg} alt="" />
        </figure>
        <div className=" p-5 text-[#545C6D]">
          <p className="text-md">
            فرماندهان در پشت میز مذاکره، چه در
            محیط شرکت یا در هنگام خریدن یک خودرو،
            مسلط، بی‌امان، و بی‌رحم هستند. دلیلش
            این نیست که آنها فی‌نفسه سنگدل یا شرور
            هستند - بلکه مسئله اینجا است که شخصیت
            فرمانده واقعاً از چالش و نبرد حاضر
            جوابی در محیط لذت می‌برد و اگر طرف
            مقابل نتواند مقاومت کند، هیچ دلیلی
            ندارد که فرمانده از پیروزی نهایی خود
            چشم‌پوشی کند
          </p>
        </div>
        <div class="description-pullout">
          شاید تفکری که در ذهن فرمانده جریان دارد
          این باشد "هیچ اهمیتی نمی‌دهم که مرا
          ح*****ه بی‌رحمی بدانی، به شرطی که
          ح*****ه کارآمدی باشم".
        </div>
        <div className=" p-5 text-[#545C6D]">
          <p className="text-md">
            اگر کسی باشد که فرمانده به وی احترام
            بگذارد، آن فرد کسی است که از لحاظ فکری
            قادر است با دقت و کیفیتی همانند خودش
            با وی برابری کند. شخصیت فرمانده مهارت
            خاصی در شناخت استعدادهای دیگران دارد و
            این امر به وی هم در زمینه تیم‌سازی کمک
            می‌کند (زیرا هیچ کس، هر چقدر هم که
            باهوش باشد نمی‌تواند همه چیز را به
            تنهایی انجام دهد)، و هم مانع از آن
            می‌شود که فرمانده غرور و برتری بیش از
            حدی نشان دهد. با این حال، این افراد
            مهارت خاصی دیگری نیز در برشمردن شکست
            دیگران با بی‌رحمی فراوان دارند و این
            جا است که فرماندهان واقعاً دچار دردسر
            می‌شوند.
          </p>
        </div>

        <div></div>
      </section>
      <PersonTypes
        img1={Margaret}
        name1={'  Margaret Thatcher'}
        img2={steve}
        name2={'Steve Jobs'}
        img3={whoopi}
        name3={' Whoopi Goldberg'}
        img4={franklin}
        name4={'Franklin D. Roosevelt'}
      />
    </main>
  );
}

export default ENTJ;
