import React from 'react';
import entp from '../../images/entp.svg';
import entjSvg from '../../images/entjSvg.svg';
import './style.css';
import PersonTypes from './PersonTypes/PersonTypes';
import HeaderType from './Type/Type';
import Margaret from '../../images/margaret.svg';
import steve from '../../images/steve.svg';
import whoopi from '../../images/whoopi.svg';
import franklin from '../../images/franklin.svg';
import GreatTalk from './GreatTalk/GreatTalk';

function ENTP() {
  return (
    <main>
      <HeaderType
        typeName={'مجادله گر'}
        type={'ENTP-A / ENTP-T'}
        typeImg={entp}
        color={'#88619A'}
      />

      <section className="container mx-auto  mt-10 p-20 font-medium   ">
        <h1 className="text-3xl text-[#51596A] pb-5">
          شخصیت مجادله گر
        </h1>
        <GreatTalk
          text='مسیر ناامن متفکری مستقل را دنبال کنید. ایده‌های خود را در معرض خطر اختلاف نظر قرار دهید. نظرات خود را بیان کنید و از برچسب "احمق بودن" کمتر بترسید تا از ننگ همرنگ شدن با جماعت. و در خصوص مسائلی که برایتان مهم است، به هر قیمتی که شده از آنها دفاع کنید.'
          author="THOMAS J. WATSON"
        />

        <div className=" p-5 text-[#545C6D] ">
          <p className="text-md">
            گونه شخصیتی مجادله‌گر به‌راستی وکیل
            مدافع شیطان است، یعنی نابود کردن
            استدلال‌ها و اعتقادات و در معرض دید
            همگان قرار دادن حاصل این تلاش.
            مجادله‌گران بر خلاف شخصیت‌های مصمم‌تر،
            این کار را به این دلیل انجام نمی‌دهند
            که می‌خواهند به هدفی عمیق‌تر یا
            استراتژیک برسند، بلکه فقط به این دلیل
            ساده چنین کاری را می‌کنند که برایشان
            سرگرم‌کننده است. هیچ‌کس به اندازه
            مجادله‌گران نبرد ذهنی را دوست ندارد،
            چرا که این کار به آنها فرصتی برای
            به‌کار بستن شوخ طبعی خود بدون اینکه به
            زحمت بیفتند، نشان دادن دانش گسترده خود
            و ظرفیت ربط دادن ایده‌های پراکنده برای
            اثبات حرفشان را می‌دهد.
          </p>
        </div>

        <div className=" p-5 text-[#545C6D] mt-5">
          <h2 className="text-lg text-[#51596A] pb-5">
            در اینجا هیچ قانونی وجود ندارد - ما
            داریم تلاش می‌کنیم کاری را به انجام
            برسانیم.
          </h2>
          <p className="text-md">
            مجادله‌گران که تا حدودی از اینکه طرف
            شکست‌خورده بحث باشند لذت می‌برند، عاشق
            تمرین ذهنی به پرسش کشیدن نظام غالب
            اندیشه، بی‌ارزش کردن آنها در حین
            بازسازی نظام‌های موجود یا به هم ریختن
            امور و طرح آنها به شیوه‌هایی تازه
            هستند. با این حال از توضیح روال معمول
            اجرای پیشنهادهای خود در عالم واقع عاجز
            هستند. شخصیت‌های مجادله‌گر عاشق این
            هستند که "ایده آفرینی" کنند و افکار
            بزرگی داشته باشند، اما از اینکه به هر
            قیمتی گرفتار انجام "کارهای سنگین"
            شوند، پرهیز می‌کنند. مجادله‌گران تنها
            حدود سه درصد از جمعیت را تشکیل می‌دهند
            که هیچ اشکالی هم ندارد زیرا می‌توانند
            ایده‌های اصیلی را پدید بیاورند، سپس
            کنار بکشند و اجازه بدهند شخصیت‌های
            رایج‌تر و سختکوش‌تر زحمت تدارکات مربوط
            به اجرا و نگهداری را بکشند.
          </p>
        </div>
        <figure className="m-10">
          <img src={entjSvg} alt="" />
        </figure>
        <div className=" p-5 text-[#545C6D]">
          <p className="text-md">
            مجادله‌گران برای مهار توانایی‌های
            طبیعی خود نسبت به دیگران راه درازتری
            در پیش دارند - استقلال فکری و
            چشم‌انداز باز آنها فوق‌العاده ارزشمند
            است به‌خصوص وقتی مسئول انجام کاری
            باشند یا حداقل کسی که مسئول است از
            آنها حرف‌شنوی داشته باشد، اما انجام
            عملی کارها نیازمند مقداری پیگیری است
            که افراد دارای گونه شخصیتی مجادله‌گر
            نمی‌توانند از پس آن برآیند.
            مجادله‌گران پس از اینکه جایگاه خود را
            مستحکم کردند، باید به خاطر داشته باشند
            که برای اینکه ایده‌هایشان به ثمر
            بنشیند، همیشه برای کنار هم چیدن
            بخش‌های آن به دیگران وابسته هستند -
            چنانچه مجادله‌گران بخش زیادی از وقت
            خود را صرف "پیروز شدن" در مباحثات کنند
            تا ایجاد اجماع، در نهایت پشتیبانی لازم
            را برای موفق شدن در اختیار نخواهند
            داشت. افراد دارای این گونه شخصیتی به
            این دلیل که نقش وکیل مدافع شیطان را
            به‌خوبی ایفا می‌کنند، ممکن است متوجه
            شوند که پیچیده‌ترین و باارزش‌ترین چالش
            فکری درک دیدگاه‌های احساساتی‌تر، و
            استدلال در خصوص ملاحظات و سازش در کنار
            منطق و پیشرفت است.
          </p>
        </div>
        <div class="description-pullout">
          ناقض غریبی در مورد مجادله‌گران رخ می‌دهد
          زیرا آنها واقعاً صادق هستند، اما به‌طور
          خستگی‌ناپذیر برای اثبات چیزهایی استدلال
          می‌کنند که در واقع به آنها باور ندارند
          یعنی پای خود را در کفش دیگران می‌کنند تا
          در مورد یک حقیقت از منظری دیگر استدلال
          نمایند
        </div>

        <div className=" p-5 text-[#545C6D]">
          <p className="text-md">
            ایفای نقش وکیل مدافع شیطان به افراد
            دارای گونه شخصیتی مجادله‌گر کمک می‌کند
            تا نه تنها درک بهتری از استدلال دیگران
            کسب کنند، بلکه درک بهتری از عقاید
            مخالف بیابند - چرا که مجادله‌گران
            هستند که در تأیید چنین عقیده‌هایی
            استدلال می‌کنند.
          </p>
        </div>

        <div></div>
      </section>
      <PersonTypes
        img1={Margaret}
        name1={'Thatcher'}
        img2={Margaret}
        name2={'Thatcher'}
        img3={Margaret}
        name3={'Thatcher'}
        img4={Margaret}
        name4={'Thatcher'}
      />
    </main>
  );
}

export default ENTP;
