import { Link } from 'react-router-dom';

import haland from '/src/images/Haland.png';
import disk from '/src/images/Disk.png';
import mbti from '/src/images/Mbti.png';
import '../../index.css';
export default function TestCard() {
  // component for show test img with little explanation
  // has 2 prop: img, description
  return (
    <>
      <section className="container mx-auto p-7">
        <section className="flex flex-col gap-5">
          <h1 className="">نمونه تست</h1>
          <div className="border float-right p-4  ">
            <p className="">
              <img
                src={disk}
                alt=""
                className="test-sec border"
              />
              <h1 className="p-3">
                تست دیسک (DISC)
              </h1>
              اما یکی دیگر از آزمون‌های مفید پیش
              از استخدام، آزمون رغبت شغلی هالند
              است. اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما اما
              یکی دیگر از آزمون‌های مفید پیش از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما اما
              یکی دیگر از آزمون‌های مفید پیش از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما اما
              یکی دیگر از آزمون‌های مفید پیش از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما
              باشید.
              <Link to="/talent-survey/disk">
                <button className="float-left bg-secondaryColor px-7 p-2 rounded-3xl m-3">
                  شروع
                </button>
              </Link>
            </p>
          </div>
          <div className="border float-right p-4  ">
            <p className="">
              <img
                src={mbti}
                alt=""
                className="test-sec border"
              />
              <h1 className="p-3">
                تست MBTI (مایرز بریگز)
              </h1>
              اما یکی دیگر از آزمون‌های مفید پیش
              از استخدام، آزمون رغبت شغلی هالند
              است. اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما اما
              یکی دیگر از آزمون‌های مفید پیش از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما اما
              یکی دیگر از آزمون‌های مفید پیش از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما اما
              یکی دیگر از آزمون‌های مفید پیش از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما
              باشید.
              <Link to="/talent-survey/mbti">
                <button className="float-left bg-secondaryColor px-7 p-2 rounded-3xl m-3">
                  شروع
                </button>
              </Link>
            </p>
          </div>
          <div className="border float-right p-4  ">
            <p className="">
              <img
                src={haland}
                alt=""
                className="test-sec border"
              />
              <h1 className="p-3">تست هالند</h1>
              اما یکی دیگر از آزمون‌های مفید پیش
              از استخدام، آزمون رغبت شغلی هالند
              است. اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما اما
              یکی دیگر از آزمون‌های مفید پیش از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما اما
              یکی دیگر از آزمون‌های مفید پیش از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما اما
              یکی دیگر از آزمون‌های مفید پیش از
              استخدام، آزمون رغبت شغلی هالند است.
              اگر تا به حال نام این آزمون به
              گوشتان نخورده یا با آن آشنایی کامل
              ندارید تا انتهای این مقاله با ما
              باشید.
              <Link to="/talent-survey/haland">
                <button className="float-left bg-secondaryColor px-7 p-2 rounded-3xl m-3">
                  شروع
                </button>
              </Link>
            </p>
          </div>
          <div></div>
          <div></div>
        </section>
      </section>
    </>
  );
}
