export const questions_mbti = [{
        question: 'آیا شناختن شما',
        choices: [
            { text: 'آسان است ؟', value: 'E' },
            { text: 'دشوار است ؟', value: 'I' },

        ],
    },
    {
        question: 'ایا',
        choices: [
            { text: 'با هر کسی تا حدی که الزم می دانید به راحتی صحبت می کنید؟', value: 'T' },
            { text: ' فقط با افراد خاصی آن هم در شرایط خاصی میتوانید زیاد صحبت کنید؟', value: 'F' },

        ],
    },
    {
        question: 'شما معمولا',
        choices: [
            { text: 'زود جوش هستید؟', value: 'J' },
            { text: 'آرام و درون گرا هستید؟', value: 'P' },

        ],
    },
    {
        question: 'روابط دوستانه شما ',
        choices: [
            { text: 'با افرادی معدود ولی عمیق است؟', value: 'S' },
            { text: 'با تعداد بسیاری از افراد ولی سطحی است؟', value: 'N' },

        ],
    },
    {
        question: 'می توانید به طور نامحدود',
        choices: [
            { text: 'فقط با کسانی که عالیق مشترکی با شما دارند صحبت کنید؟', value: 'T' },
            { text: 'می توانید تقریبا با هر کسی صحبت کنید؟', value: 'F' },

        ],
    },
    {
        question: 'در صحبت کردن با دوستانتان',
        choices: [
            { text: 'گاهی مسائل شخصی را به طور خصوصی به آنان می گویید؟', value: 'E' },
            { text: 'تقریبا هرگز چیزی را که نمی خواهید بگویید بیان نمی کنید؟', value: 'I' },

        ],
    },
    {
        question: 'آیا معمولا',
        choices: [
            { text: 'آزادانه احساسات خود را نشان می دهید؟', value: 'J' },
            { text: ' احساسات خود را نشان نمی دهید؟', value: 'P' },

        ],
    },
    {
        question: 'وقتی غریبه ها به شما توجه می کنند',
        choices: [
            { text: 'احساس ناراحتی می کنید؟', value: 'J' },
            { text: 'اصال ناراحت نمی شوید؟', value: 'P' },

        ],
    },
    {
        question: 'آیا عادت دارید',
        choices: [
            { text: 'به هیچ کس اعتماد نکنید یا حداکثر به یک نفر اعتماد کنید؟', value: 'S' },
            { text: ' تعدادی دوست دارید که به آنها اعتماد می کنید؟', value: 'N' },

        ],
    },
    {
        question: 'آیا',
        choices: [
            { text: 'فکر می کنید همه ی کسانی را که دوست دارید می دانند که دوستشان دارید؟', value: 'E' },
            { text: 'به بعضی افراد عالقه مند هستید بی آنکه بگذارید آنها بدانند؟', value: 'I' },

        ],
    },
    // {
    //     question: 'وقتی با گروهی از افراد هستید معموال ترجیح می دهید ؟',
    //     choices: [
    //         { text: 'به صحبت گروهی بپردازید؟', point: 1 },
    //         { text: 'هر بار فقط با یک فرد صحبت کنید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'در بین دوستانتان آیا',
    //     choices: [
    //         { text: 'یکی از آخرین کسانی هستید که خبرها را می شنوید؟', point: 1 },
    //         { text: 'همه نوع خبری در مورد هر کسی دارید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'در یک محفل اجتماعی',
    //     choices: [
    //         { text: 'سعی می کنید کسی را که دوست دارید با او صحبت کنید به گوشه ای بکشید؟', point: 1 },
    //         { text: 'با گروه می جوشید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'در میهمانی ها',
    //     choices: [
    //         { text: 'گاهی کسل می شوید؟', point: 1 },
    //         { text: 'همیشه به شما خوش می گذرد؟', point: 2 },

    //     ],
    // },
    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'صحبت کردن', point: 1 },
    //         { text: 'نوشتن', point: 2 },

    //     ],
    // },
    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: ' آرام', point: 1 },
    //         { text: 'سرزنده', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است  ؟',
    //     choices: [
    //         { text: 'ساکت', point: 1 },
    //         { text: 'پر حرف', point: 2 },

    //     ],
    // },
    // {
    //     question: 'در یک مهمانی دوست دارید:',
    //     choices: [
    //         { text: ' کاری کنید که مراسم به خوبی برگزار شود؟', point: 1 },
    //         { text: 'می گذارید هر کسی به میل خودش خوش بگذراند؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'هنگامی که با گروهی از دوستان نزدیک خودتان هستید:',
    //     choices: [
    //         { text: 'بیشتر از بقیه صحبت می کنید؟', point: 1 },
    //         { text: ' کمتر از بقیه؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'در یک گروه بزرگ اغلب',
    //     choices: [
    //         { text: 'دیگران را معرفی می کنید؟', point: 1 },
    //         { text: 'معرفی می شوید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'زمانی که در مورد یک پیشامد فکر می کنید ترجیح می دهید:',
    //     choices: [
    //         { text: 'در این مورد با شخصی صحبت کنید؟', point: 1 },
    //         { text: 'در مورد آن خوب فکر می کنید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'آیا افرادی که تازه با شما آشنا می شوند می توانند بگویند به چه عالقه دارید؟',
    //     choices: [
    //         { text: 'خیلی سریع', point: 1 },
    //         { text: 'تنها پس از آنکه شما را خوب شناختند', point: 2 },

    //     ],
    // },
    // {
    //     question: 'آیا معموال منظورتان',
    //     choices: [
    //         { text: 'بیشتر از آنچه می گویید می باشد؟', point: 1 },
    //         { text: 'کمتر از آنچه می گویید است؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'وقتی که غریبه ها را مالقات می کنید',
    //     choices: [
    //         { text: 'برایتان خوشایند یا دست کم راحت است؟', point: 1 },
    //         { text: 'زحمت زیادی برایتان دارد؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'وقتی در جلسه ای راجع به چیزی نظری دارید که باید گفته شود',
    //     choices: [
    //         { text: 'آن را مطرح می کنید؟', point: 1 },
    //         { text: 'در مورد گفتن آن تردید دارید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'ترجیح می دهید در نظر مردم چگونه باشید؟',
    //     choices: [
    //         { text: 'فردی اهل عمل؟', point: 1 },
    //         { text: 'فردی مبتکر و خالق؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'هنگام مطالعه با هدف سرگرم شدن آیا',
    //     choices: [
    //         { text: 'از شیوه ی بیان عجیب و ابتکاری مطالب لذت می برید؟', point: 1 },
    //         { text: 'نویسندگانی را دوست دارید که به روشنی منظور خود را می رسانید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'اگر معلم بودید ترجیح می دادید',
    //     choices: [
    //         { text: 'واقعیت ها را تدریس کنید؟', point: 1 },
    //         { text: 'نظریه ها را شرح دهید؟ ', point: 2 },

    //     ],
    // },
    // {
    //     question: 'معموال با کدام شخص راحت تر ارتباط برقرار می کنید؟',
    //     choices: [
    //         { text: 'با فردی تخیلی؟', point: 1 },
    //         { text: 'با فردی واقع بین؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'در انجام کاری که بسیاری از مردم انجام می دهند ترجیح می دهید',
    //     choices: [
    //         { text: 'آن را به شیوه ی پذیرفته شده انجام دهید؟', point: 1 },
    //         { text: 'روش خاص خود را برای انجام آن ابداع کنید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'درشیوه ی زندگی تان ترجیح می دهید',
    //     choices: [
    //         { text: 'متفاوت باشید؟', point: 1 },
    //         { text: 'متعارف عمل کنید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟ ',
    //     choices: [
    //         { text: 'عبارت ', point: 1 },
    //         { text: 'مفهوم', point: 2 },

    //     ],
    // },

    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'ساختن', point: 1 },
    //         { text: 'اختراع کردن', point: 2 },

    //     ],
    // },

    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'واقعی', point: 1 },
    //         { text: ' انتزاعی', point: 2 },

    //     ],
    // },

    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'حروفی', point: 1 },
    //         { text: 'ارقامی', point: 2 },

    //     ],
    // },

    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'تولید', point: 1 },
    //         { text: 'طراحی', point: 2 },

    //     ],
    // },

    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: ' عالمت', point: 1 },
    //         { text: ' نماد ', point: 2 },

    //     ],
    // },

    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'پذیرش', point: 1 },
    //         { text: 'تغییر', point: 2 },

    //     ],
    // },

    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'شناخته شده', point: 1 },
    //         { text: 'ناشناخته', point: 2 },

    //     ],
    // },

    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'واقعیت ها', point: 1 },
    //         { text: 'ایده ها', point: 2 },

    //     ],
    // },

    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'زیربنا', point: 1 },
    //         { text: 'روبنا', point: 2 },

    //     ],
    // },
    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'نظریه', point: 1 },
    //         { text: 'تجربه', point: 2 },

    //     ],
    // },
    // {
    //     question: ' کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'مایع', point: 1 },
    //         { text: 'جامد', point: 2 },

    //     ],
    // },
    // {
    //     question: ' کدام یک تمجید بیشتری از یک فرد است ؟',
    //     choices: [
    //         { text: 'بصیرت دارد؟', point: 1 },
    //         { text: 'عقل سلیم دارد؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'اگر بخواهید در همسایگی خود برای مسائلی مانند کمک به کمیته امداد به جمع آوری اعانه بپردازید',
    //     choices: [
    //         { text: 'درخواست شما خالصه و تجاری است؟', point: 1 },
    //         { text: 'دوستانه و اجتماعی است؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام گزاره تعریف و تمجید بیشتری از شما به شمار می آید؟',
    //     choices: [
    //         { text: 'شخصی با احساسات واقعی ؟', point: 1 },
    //         { text: 'شخصی همیشه منطقی؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'آیا در تصمیم گیری ‚ بیشتر',
    //     choices: [
    //         { text: 'قلبتان بر عقلتان غلبه دارد؟', point: 1 },
    //         { text: 'عقلتان بر قلبتان؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'هنگام گفتگو بیشتر تمایل دارید',
    //     choices: [
    //         { text: 'تمجید کنید؟', point: 1 },
    //         { text: 'سرزنش کنید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'احساس می کنید که کدام یک عیب بدتری به شمار می آید؟',
    //     choices: [
    //         { text: 'همدردی نکردن؟', point: 1 },
    //         { text: 'استدالل پذیر نبودن؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'اگر بخواهید عمل خاصی را انجام دهید کدام یک از این دو گزاره برایتان جالب تر بنظر می آید؟',
    //     choices: [
    //         { text: 'مردم خیلی دوست دارند که شما آن را انجام دهید؟', point: 1 },
    //         { text: 'این منطقی ترین کاری است که انجام می دهید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'فکر می کنید وجود کدام یک در فرد نقص بیشتری است؟',
    //     choices: [
    //         { text: 'خیلی احساساتی بودن؟', point: 1 },
    //         { text: 'به اندازه کافی احساساتی نبودن؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'احساس می کنید کدام یک عیب بدتری به شمار می آید؟',
    //     choices: [
    //         { text: 'گرمی زیاد نشان دادن؟', point: 1 },
    //         { text: 'به اندازه کافی گرم نبودن؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'آیا معمولا',
    //     choices: [
    //         { text: 'برای احساس بیشتر از منطق ارزش قائل هستید؟', point: 1 },
    //         { text: 'برای منطق بیشتر از احساس؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'متقاعد کردن', point: 1 },
    //         { text: ' لمس کردن', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'موافقت کردن', point: 1 },
    //         { text: 'پرسیدن', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'مزایا', point: 1 },
    //         { text: 'برکت', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'تحلیل کردن', point: 1 },
    //         { text: 'همدردی', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'نرم', point: 1 },
    //         { text: 'سخت', point: 2 },

    //     ],
    // },

    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'پایبند به اندیشه خود', point: 1 },
    //         { text: 'دلگرم', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'چه کسی؟', point: 1 },
    //         { text: 'چه چیزی؟؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'محتاط؟', point: 1 },
    //         { text: ' خوش خیال؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'مالیم', point: 1 },
    //         { text: 'محکم', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'عدالت', point: 1 },
    //         { text: 'بخشندگی', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'غیر انتقادی', point: 1 },
    //         { text: 'انتقادی', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'متفکر', point: 1 },
    //         { text: 'احساسی', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟',
    //     choices: [
    //         { text: 'دلسوزی', point: 1 },
    //         { text: 'دوراندیشی', point: 2 },

    //     ],
    // },
    // {
    //     question: 'بیشتر مراقب کدام یک هستید؟',
    //     choices: [
    //         { text: 'احساسات افراد؟', point: 1 },
    //         { text: 'حقوق افراد؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'آیا به طور طبیعی:',
    //     choices: [
    //         { text: 'به مردم بیشتر از اشیاء عالقه مندید؟', point: 1 },
    //         { text: 'به اشیاء و نحوه کار آنها بیشتر از روابط انسانها عالقه مندید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'برای انجام یک کار ‚ آیا؟',
    //     choices: [
    //         { text: 'آن را زود شروع می کنید بطوریکه پس از پایان کار وقت اضافی داشته باشید؟', point: 1 },
    //         { text: 'آن را به لحظه آخر واگذار کرده و سعی میکنید هر چه سریعتر انجام دهید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'هنگامی که رخدادی پیش بینی نشده شما را مجبور به کنار گذاشتن برنامه روزانه تان می نماید',
    //     choices: [
    //         { text: 'آیا بوجود آمدن وقفه در برنامه تان را مزاحمت تلقی می نمایید؟', point: 1 },
    //         { text: 'با تغییر وضعیت بوجود آمده با خوشرویی برخورد می کنید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'آیا مطابق برنامه عمل کردن',
    //     choices: [
    //         { text: 'مورد رضایت شماست؟', point: 1 },
    //         { text: 'شما را در تنگنا قرار می دهد', point: 2 },

    //     ],
    // },
    // {
    //     question: 'هنگام شروع یک پروژه ی بزرگ که تا یک هفته باید انجام شود',
    //     choices: [
    //         { text: 'زمانی را برای تهیه ی فهرستی از کارهایی که می بایست انجام شوند بر اساس اولویت در نظر می گیرید؟', point: 1 },
    //         { text: 'دل به دریا می زنید و شروع می کنید؟', point: 2 },

    //     ],
    // },

    // {
    //     question: 'اگر قرار باشد که کاری خاص را از پیش در زمانی خاص انجام دهید',
    //     choices: [
    //         { text: 'طبق برنامه عمل کردن برای شما خوشایند است؟', point: 1 },
    //         { text: ' از در چهار چوب قرار گرفتن احساس ناخوشایندی می کنید؟', point: 2 },

    //     ],
    // },

    // {
    //     question: 'آیا ترجیح می دهید',
    //     choices: [
    //         { text: 'قرار مالقات ها وعده ها و میهمانی ها را از پیش تعیین کنید؟', point: 1 },
    //         { text: 'فردی باشید که در لحظه آخر بتوانید آزادانه آنجایی را که تمایل دارید انتخاب کنید؟', point: 2 },

    //     ],
    // },

    // {
    //     question: 'آیا ',
    //     choices: [
    //         { text: 'ترجیح می دهید کارها را در دقیقه آخر انجام دهید؟', point: 1 },
    //         { text: 'انجام دادن کارها در دقیقه آخر شما را عصبی می کند؟', point: 2 },

    //     ],
    // },

    // {
    //     question: 'آیا فکر می کنید که داشتن یک برنامه روزانه',
    //     choices: [
    //         { text: 'راحت ترین روش برای دادن کارهاست؟', point: 1 },
    //         { text: 'حتی اگر ضروری باشد رنج آور است؟', point: 2 },

    //     ],
    // },

    // {
    //     question: 'وقتی که کار خاصی برای انجام دادن دارید آیا مایلید',
    //     choices: [
    //         { text: 'پیش از آغاز کار ‚ با دقت آن را سازماندهی کنید؟', point: 1 },
    //         { text: 'آنچه ضروری است را حین انجام کار متوجه شوید؟', point: 2 },

    //     ],
    // },

    // {
    //     question: 'آیا ',
    //     choices: [
    //         { text: 'روزمره بودن برایتان ساده تر است؟', point: 1 },
    //         { text: 'متنوع بودن؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'در زندگی شخصی وقتی به پایان مسئولیتی می رسید ',
    //     choices: [
    //         { text: 'آیا می دانید کار بعدی چیست و آماده درگیر شدن با آن هستید؟', point: 1 },
    //         { text: 'تا پیشامد بعدی از آرامش خود خوشنود هستید؟ ', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟ ',
    //     choices: [
    //         { text: 'وقت شناس', point: 1 },
    //         { text: 'بی دغدغه', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟ ',
    //     choices: [
    //         { text: 'منضبط', point: 1 },
    //         { text: 'آسان گیر ', point: 2 },

    //     ],
    // },
    // {
    //     question: 'کدام لغت برای شما جالبتر است ؟ ',
    //     choices: [
    //         { text: 'منظم', point: 1 },
    //         { text: 'خودمانی ', point: 2 },

    //     ],
    // },
    // {
    //     question: 'آیا ',
    //     choices: [
    //         { text: 'برنامه ریز', point: 1 },
    //         { text: 'بی برنامه', point: 2 },

    //     ],
    // },
    // {
    //     question: 'آیا به طور کلی ترجیح می دهید: ',
    //     choices: [
    //         { text: 'برای دیدار کسی از قبل برنامه ریزی کنید؟', point: 1 },
    //         { text: ' آزاد باشید و لحظه ای عمل کنید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'وقتی برای یک روز جایی می روید . آیا ترجیح می دهید : ',
    //     choices: [
    //         { text: 'برای اینکه چه کاری و چه موقع انجام دهید برنامه ریزی کنید؟', point: 1 },
    //         { text: ' فقط می روید؟', point: 2 },

    //     ],
    // },
    // {
    //     question: 'در مورد کارهای روز مره ترجیح می دهید ',
    //     choices: [
    //         { text: 'ابتدای صبح همه کارها را انجام دهید؟', point: 1 },
    //         { text: 'در ضمن فرصت پیش آمده حین انجام کارهای جالب آنها را انجام می دهید؟ ', point: 2 },

    //     ],
    // },
    // {
    //     question: 'آیا ',
    //     choices: [
    //         { text: 'از اتمام کارها پیش از زمان موعود احساس رضایت می کنید؟', point: 1 },
    //         { text: 'از سرعت و کارآمدی خود در لحظات آخر انجام کار لذت می برید؟ ', point: 2 },

    //     ],
    // },



]