export const questions_mbti = [
  {
    question: ' در یک مهمانی ',
    choices: [
      {
        text: 'با افراد زیادی صحبت میکنید؛ حتی کسانی که خیلی نمیشناسید ',
        value: 'E',
      },
      {
        text: 'فقط با چند نفر که کاملا آشنا هستید صحبت میکنید  ',
        value: 'I',
      },
    ],
  },
  {
    question: ' کدام گزینه بیشتر شبیه شماست: ',
    choices: [
      {
        text: '  به شواهد و اطلاعات موجود اهمیت میدید تا فکر و تحلیل ذهنیتون',
        value: 'S',
      },
      {
        text: ' به فکر و تحلیل ذهنیتون اهمیت میدید تا شواهد و اطلاعات موجود ',
        value: 'N',
      },
    ],
  },
  {
    question: '  به نظرتون کدوم وضعیت بدتره',
    choices: [
      {
        text: ' بلندپرواز و خیالاتی بودن ',
        value: 'S',
      },
      {
        text: ' درگیر کارهای روتین و تکراری بودن ',
        value: 'N',
      },
    ],
  },
  {
    question:
      'کدوم بیشتر بر تصمیماتتون اثر میذاره:  ',
    choices: [
      {
        text: ' اصول (اخلاقی، قانونی و …) ',
        value: 'T',
      },
      { text: ' احساسات و هیجانات ', value: 'F' },
    ],
  },
  {
    question: ' بیشتر با چی متقاعد میشید؟ ',
    choices: [
      {
        text: '  استدلال منطقی و عقلی',
        value: 'T',
      },
      {
        text: ' برانگیخته شدن احساسات ',
        value: 'F',
      },
    ],
  },
  {
    question: ' ترجیح میدید چطور کار کنید؟ ',
    choices: [
      { text: ' با یک برنامه منظم ', value: 'J' },
      {
        text: ' هر موقع که حسش بود ',
        value: 'P',
      },
    ],
  },
  {
    question: '  چطور انتخاب می کنید؟',
    choices: [
      {
        text: ' معمولا با دقت و توجه ',
        value: 'J',
      },
      {
        text: '  معمولا آنی و بدون فکر',
        value: 'P',
      },
    ],
  },
  {
    question: ' در مهمانی ها معمولا: ',
    choices: [
      {
        text: 'تا دیروقت میمانید و احساس انرژی بالایی دارید  ',
        value: 'E',
      },
      {
        text: ' سعی میکنید زودتر بروید و احساس خالی شدن انرژی میکنید ',
        value: 'I',
      },
    ],
  },
  {
    question:
      ' بیشتر به سمت چه افرادی جذب میشید: ',
    choices: [
      {
        text: '  افراد دقیق با حواس پنجگانه قوی',
        value: 'S',
      },
      {
        text: ' افراد با تصور خلاق ',
        value: 'N',
      },
    ],
  },
  {
    question: ' به کدوم بیشتر علاقمندید: ',
    choices: [
      {
        text: ' چیزی که موجوده (واقعیت ها ',
        value: 'S',
      },
      {
        text: ' چیزی که ممکنه (امکان ها) ',
        value: 'N',
      },
    ],
  },
  {
    question:
      'در برداشت از رفتار دیگران چه چیز رو اصل قرار میدید:  ',
    choices: [
      {
        text: 'قوانین و ضوابط موجود  ',
        value: 'T',
      },
      {
        text: ' شرایط و وضعیت حال حاضر ',
        value: 'F',
      },
    ],
  },
  {
    question: 'در برخورد با دیگران معمولا:  ',
    choices: [
      {
        text: '  به کار و وظیفه اهمیت میدید',
        value: 'T',
      },
      {
        text: ' به افراد و احساساتشون اهمیت میدید ',
        value: 'F',
      },
    ],
  },
  {
    question: ' شما بیشتر: ',
    choices: [
      { text: ' وقت شناس هستید ', value: 'J' },
      {
        text: ' بی عجله و ریلکس هستید ',
        value: 'P',
      },
    ],
  },
  {
    question: ' شما بیشتر از چی اذیت میشید؟ ',
    choices: [
      {
        text: '  اینکه کارهای ناتمام زیادی دارید',
        value: 'J',
      },
      {
        text: ' اینکه خیلی از کارها و برنامه هاتون تموم شده ',
        value: 'P',
      },
    ],
  },
  {
    question: '  .در گروه های دوستی معمولا:',
    choices: [
      {
        text: '  در جریان همۀ اخبار هستید',
        value: 'E',
      },
      {
        text: '  از آخرین نفراتی هستید که از خبرهای تازه باخبر میشن',
        value: 'I',
      },
    ],
  },
  {
    question:
      ' در انجام کارهای عادی روزمره بیشتر: ',
    choices: [
      {
        text: ' به روش معمول و مثل بیشتر مردم، کار رو انجام میدید ',
        value: 'S',
      },
      {
        text: ' کار رو متفاوت و به سبک خودتون انجام میدید ',
        value: 'N',
      },
    ],
  },
  {
    question: ' به نظرتون نویسندگان بهتره که: ',
    choices: [
      {
        text: ' منظورشون رو مستقیم بنویسند ',
        value: 'S',
      },
      {
        text: 'از تشبیه و توصیفات ادبی هم استفاده کنند  ',
        value: 'N',
      },
    ],
  },
  {
    question: ' کدوم براتون جالبتره؟ ',
    choices: [
      { text: 'ثبات فکری  ', value: 'T' },
      {
        text: ' ارتباطات صمیمانه انسانی ',
        value: 'F',
      },
    ],
  },
  {
    question: ' با انجام کدوم راحت ترید؟ ',
    choices: [
      { text: ' قضاوت منطقی ', value: 'T' },
      { text: 'قضاوت اخلاقی  ', value: 'F' },
    ],
  },
  {
    question: '  کارهایی رو دوست دارید که:',
    choices: [
      {
        text: ' از پیش تعیین شده و مشخص باشند ',
        value: 'J',
      },
      {
        text: ' از پیش تعیین شده و مشخص نباشند ',
        value: 'P',
      },
    ],
  },
  {
    question: ' کدوم صفات به شما نزدیکتره؟ ',
    choices: [
      { text: ' جدی و مصمم ', value: 'J' },
      { text: 'آسونگیر و ریلکس  ', value: 'P' },
    ],
  },
  {
    question: '.در تماس تلفنی:  ',
    choices: [
      {
        text: 'کمتر چیزی رو که قبلا گفتید تکرار میکنید',
        value: 'E',
      },
      {
        text: 'چیزی که قبلا گفتید رو جمع بندی و تکرار میکنید  ',
        value: 'I',
      },
    ],
  },
  {
    question: '  آمار و اطلاعات:',
    choices: [
      { text: 'واضح و مشخص هستند  ', value: 'S' },
      {
        text: '  بیانگر اصول کلی هستند',
        value: 'N',
      },
    ],
  },
  {
    question:
      ' افرادی که آینده رو بررسی و تحلیل میکنند: ',
    choices: [
      { text: ' آزاردهنده هستند ', value: 'S' },
      { text: ' جالب توجه هستند ', value: 'N' },
    ],
  },
  {
    question: ' .اغلب چطور هستید؟ ',
    choices: [
      { text: ' آرام و صبور ', value: 'T' },
      { text: 'همدل و خونگرم  ', value: 'F' },
    ],
  },
  {
    question: ' کدوم بدتره؟ ',
    choices: [
      { text: 'بی عدالت بودن  ', value: 'T' },
      { text: ' بی رحم بودن ', value: 'F' },
    ],
  },
  {
    question:
      ' شما معمولا اجازه میدید اتفاقات چطور پیش بره؟ ',
    choices: [
      {
        text: ' با تصمیم گیری دقیق ',
        value: 'J',
      },
      {
        text: ' شانسی و بر حسب اتفاق ',
        value: 'P',
      },
    ],
  },
  {
    question: ' چه موقعی حس بهتری دارید؟ ',
    choices: [
      {
        text: 'وقتی انتخابتون رو قطعی کردید  ',
        value: 'J',
      },
      {
        text: 'وقتی گزینه های مختلفی برای بررسی دارید  ',
        value: 'P',
      },
    ],
  },
  {
    question: ' در جمع افراد: ',
    choices: [
      {
        text: ' شما مکالمه رو شروع میکنید ',
        value: 'E',
      },
      {
        text: ' صبر میکنید تا کسی به سمت شما بیاید ',
        value: 'I',
      },
    ],
  },
  {
    question:
      ' عقل جمعی (چیزی که بیشتر مردم فکر میکنند درسته): ',
    choices: [
      {
        text: '  به ندرت زیر سوال میره',
        value: 'S',
      },
      {
        text: '  در بسیاری از موارد، میشه زیر سوالش برد',
        value: 'N',
      },
    ],
  },
  {
    question: ' بچه ها به اندازه کافی ',
    choices: [
      {
        text: '  فعالیت مفید نمیکنند',
        value: 'S',
      },
      {
        text: ' در دنیای فانتزی ذهنی خود نیستند ',
        value: 'N',
      },
    ],
  },
  {
    question:
      '  شما راحت ترید طبق چه چیزی تصمیم بگیرید؟',
    choices: [
      { text: ' استانداردها ', value: 'T' },
      { text: 'احساسات  ', value: 'F' },
    ],
  },
  {
    question: 'شما بیشتر:  ',
    choices: [
      { text: ' قاطع هستید ', value: 'T' },
      { text: ' ملایم هستید ', value: 'F' },
    ],
  },
  {
    question: ' کدوم بیشتر قابل تحسینه: ',
    choices: [
      {
        text: ' سازماندهی کردن کارها و با نظم پیش بردنشون ',
        value: 'J',
      },
      {
        text: '  سازگار شدن با شرایط و پیشبرد کارها',
        value: 'P',
      },
    ],
  },
  {
    question: 'برای کدوم بیشتر ارزش قائلی؟',
    choices: [
      {
        text: ' نامحدود و چندبعدی بودن ',
        value: 'J',
      },
      {
        text: ' گشودگی به ایده ها و افکار تازه ',
        value: 'P',
      },
    ],
  },
  {
    question:
      '  ارتباط با افراد جدید در شرایط تازه:',
    choices: [
      {
        text: ' جالبه و بهتون انرژی میده ',
        value: 'E',
      },
      {
        text: '  ازتون انرژی میگیره',
        value: 'I',
      },
    ],
  },
  {
    question: ' شما معمولا: ',
    choices: [
      {
        text: ' آدم عملگرایی هستید ',
        value: 'S',
      },
      {
        text: 'آدم رویاپردازی هستید  ',
        value: 'N',
      },
    ],
  },
  {
    question: 'شما معمولا:  ',
    choices: [
      {
        text: ' میبینید دیگران چه عملکردی دارند ',
        value: 'S',
      },
      {
        text: ' میبینید دیگران چه فکر میکنند ',
        value: 'N',
      },
    ],
  },
  {
    question: ' کدوم راضی کننده تره؟ ',
    choices: [
      {
        text: '  به طور کامل درباره موضوعی بحث کنیم',
        value: 'T',
      },
      {
        text: '  سر یک موضوع به تفاهم برسیم',
        value: 'F',
      },
    ],
  },
  {
    question: '  کدوم بیشتر شما رو هدایت میکنه؟',
    choices: [
      { text: '  مغزتون', value: 'T' },
      { text: '  قلبتون', value: 'F' },
    ],
  },
  {
    question: ' با کدوم نوع کار راحت ترید؟ ',
    choices: [
      { text: '  قراردادی بلندمدت', value: 'J' },
      {
        text: '  پروژه ای کوتاه مدت',
        value: 'P',
      },
    ],
  },
  {
    question: ' تمایل دارید: ',
    choices: [
      { text: ' با نظم پیش برید ', value: 'J' },
      {
        text: ' ببینید چه پیش میاد ',
        value: 'P',
      },
    ],
  },
  {
    question: ' .کدوم رو ترجیح میدید؟ ',
    choices: [
      {
        text: ' دوستان زیاد با تماس کوتاه تر ',
        value: 'E',
      },
      {
        text: ' چند دوست محدود با ارتباط بیشتر ',
        value: 'I',
      },
    ],
  },
  {
    question: ' بیشتر با کدوم پیش میرید؟ ',
    choices: [
      { text: 'آمار و اطلاعات  ', value: 'S' },
      { text: '  اصول کلی', value: 'N' },
    ],
  },
  {
    question: ' بیشتر به کدوم علاقه دارید؟ ',
    choices: [
      { text: ' کار تولید و پخش ', value: 'S' },
      { text: '  کار طراحی و تحقیق', value: 'N' },
    ],
  },
  {
    question:
      ' ترجیح میدید چطور ازتون تعریف کنند؟ ',
    choices: [
      { text: ' شخصی بسیار منطقی ', value: 'T' },
      {
        text: ' شخصی بسیار لطیف و ملایم',
        value: 'F',
      },
    ],
  },
  {
    question:
      'در نظر خودتون چه موقع باارزشترید؟  ',
    choices: [
      {
        text: ' محکم و پایدار باشید ',
        value: 'T',
      },
      {
        text: '  وفادار و صادق باشید',
        value: 'F',
      },
    ],
  },
  {
    question: 'معمولا کدوم رو ترجیح میدید؟  ',
    choices: [
      {
        text: 'نوشته نهایی و غیرقابل تغییر  ',
        value: 'J',
      },
      {
        text: '  نوشته مقدماتی و اولیه',
        value: 'P',
      },
    ],
  },
  {
    question:
      ' کدوم موقع احساس راحتی بیشتری دارید؟ ',
    choices: [
      { text: ' بعد از تصمیم گیری ', value: 'J' },
      { text: ' قبل از تصمیم گیری ', value: 'P' },
    ],
  },
  {
    question: '  شما:',
    choices: [
      {
        text: 'میتونید با یک فرد ناآشنا، مکالمه طولانی و خوبی داشته باشید  ',
        value: 'E',
      },
      {
        text: '  در هنگام مواجهه با افراد جدید، حرف چندانی برای گفتن ندارید',
        value: 'I',
      },
    ],
  },
  {
    question: '  به کدوم بیشتر اعتماد میکنید؟',
    choices: [
      { text: 'تجربه  ', value: 'S' },
      {
        text: '  احساس درونی در اون لحظه',
        value: 'N',
      },
    ],
  },
  {
    question: ' شما بیشتر: ',
    choices: [
      { text: ' اهل عمل هستید ', value: 'S' },
      { text: ' اهل تفکر هستید ', value: 'N' },
    ],
  },
  {
    question:
      'شخصی با کدوم ویژگی برای شما بیشتر قابل تحسینه؟  ',
    choices: [
      { text: '  منطق قوی', value: 'T' },
      { text: '  احساس قوی', value: 'F' },
    ],
  },
  {
    question: ' شما بیشتر مایلید: ',
    choices: [
      { text: ' منصف و عادل باشید ', value: 'T' },
      {
        text: ' دلسوز و همدل باشید ',
        value: 'F',
      },
    ],
  },
  {
    question: ' بیشتر ترجیح میدید: ',
    choices: [
      {
        text: ' مطمئن بشید همه چیز به خوبی برنامه ریزی شده ',
        value: 'J',
      },
      {
        text: ' بگذارید چیزها اتفاق بیفتند و طبق جریان پیش برید ',
        value: 'P',
      },
    ],
  },
  {
    question: ' .در ارتباطات انسانی: ',
    choices: [
      {
        text: 'باید بتوان در مورد مسائل مختلف، دوباره مذاکره کرد و تصمیم گرفت  ',
        value: 'J',
      },
      {
        text: '  مسائل و اتفاقات، به صورت تصادفی و بر حسب شرایط پیش میروند',
        value: 'P',
      },
    ],
  },
  {
    question: 'وقتی تلفن زنگ میزنه:  ',
    choices: [
      {
        text: 'سریع میرید تا به تماس جواب بدید  ',
        value: 'E',
      },
      {
        text: ' امیدوارید یک نفر دیگه زودتر جواب بده ',
        value: 'I',
      },
    ],
  },
  {
    question:
      ' بیشتر در کدوم زمینه به خودتون افتخار میکنید؟ ',
    choices: [
      {
        text: ' داشتن درک قوی از واقعیت ',
        value: 'S',
      },
      {
        text: '  داشتن تخیل قوی و زنده',
        value: 'N',
      },
    ],
  },
  {
    question:
      'شما بیشتر به سمت کدوم کشیده میشید؟  ',
    choices: [
      {
        text: '  مفاهیم اصلی یک موضوع',
        value: 'S',
      },
      {
        text: '  معانی پنهان یک موضوع',
        value: 'N',
      },
    ],
  },
  {
    question: 'کدوم خطای بزرگتریه؟  ',
    choices: [
      {
        text: ' بیش از حد احساساتی بودن ',
        value: 'T',
      },
      {
        text: ' بیش از حد خنثی و خشک بودن ',
        value: 'F',
      },
    ],
  },
  {
    question: '  خودتون رو کدوم میبینید؟',
    choices: [
      { text: 'سرسخت', value: 'T' },
      { text: ' دل نازک ', value: 'F' },
    ],
  },
  {
    question: '  کدوم شرایط رو بیشتر میپسندید؟',
    choices: [
      { text: '  برنامه ریزی شده', value: 'J' },
      { text: ' برنامه ریزی نشده ', value: 'P' },
    ],
  },
  {
    question: ' شما بیشتر: ',
    choices: [
      {
        text: '  برنامه زندگی یکنواختی دارید',
        value: 'J',
      },
      {
        text: 'برنامه زندگی متنوعی دارید ',
        value: 'P',
      },
    ],
  },
  {
    question: '  شما بیشتر:',
    choices: [
      {
        text: 'در ارتباطات، راحت و صمیمانه برخورد میکنید  ',
        value: 'E',
      },
      {
        text: 'ارتباط با افراد ناآشنا برای شما مشکله  ',
        value: 'I',
      },
    ],
  },
  {
    question: '  در نوشتن متن بیشتر:',
    choices: [
      {
        text: 'مستقیم و واضح منظورتون رو مینویسید  ',
        value: 'S',
      },
      {
        text: '  از بیان ادبی و غیرمستقیم هم استفاده میکنید',
        value: 'N',
      },
    ],
  },
  {
    question: ' کدوم براتون سخت تره؟ ',
    choices: [
      {
        text: '  از نظر احساسی خودتون رو جای دیگران قرار بدید',
        value: 'S',
      },
      {
        text: '  دیگران رو به خوبی به کار بگیرید و مدیریت کنید',
        value: 'N',
      },
    ],
  },
  {
    question:
      ' .کدوم رو برای خودتون آرزو دارید؟ ',
    choices: [
      {
        text: ' شفافیت در منطق و استدلال ',
        value: 'T',
      },
      {
        text: ' قوی بودن در همدلی و محبت ',
        value: 'F',
      },
    ],
  },
  {
    question: ' کدوم اشتباه بزرگتریه؟ ',
    choices: [
      {
        text: '  هیچ استانداری برای قضاوت و ارزش گذاری نداشتن',
        value: 'T',
      },
      { text: ' زیادی انتقاد کردن ', value: 'F' },
    ],
  },
  {
    question: 'کدوم رو ترجیح میدید:  ',
    choices: [
      {
        text: ' یک جشن و رویداد برنامه ریزی شده ',
        value: 'J',
      },
      {
        text: 'یک جشن و رویداد بی برنامه و یهویی  ',
        value: 'P',
      },
    ],
  },
  {
    question: ' تمایل دارید که بیشتر: ',
    choices: [
      {
        text: ' فکر شده و سنجیده رفتار کنید ',
        value: 'J',
      },
      {
        text: ' آزادانه و دلبخواه رفتار کنید ',
        value: 'P',
      },
    ],
  },
];
